{
  "metadata": {
    "title": "Microaggression: Becoming Cognizant of Our Actions",
    "slug": "microaggression-becoming-cognizant-of-our-actions",
    "publishDate": "2024-10-02",
    "tags": [
      "microaggressions",
      "gender-identity",
      "christianity",
      "personal-growth",
      "inclusion"
    ],
    "excerpt": "Exploring the impact of microaggressions through personal experiences in religious settings, and the journey toward understanding and fostering inclusivity.",
    "coverImage": "microaggression.jpg",
    "featured": false,
    "status": "published"
  },
  "content": {
    "subtitle": "Navigating the intersection of faith, identity, and intentional living",
    "sections": [
      {
        "type": "intro",
        "content": {
          "text": "Hello world!\n\nThis one is even harder to write about than “By My Hand”. I wrote these two songs on the same night, so there’s a lot of big feelings as I write this blog post now."
        },
        "order": 1
      },
      {
        "type": "text",
        "title": "The Language of Faith and Exclusion",
        "content": {
          "paragraphs": [
            "For those of you who aren’t as familiar with modern day Christianity, it’s pretty common to have catchphrases like, “Love, God, love people”, “Welcome home”, and the likes. They tell these simple, positive messages which are supposed to define the mission of the church and align with their interpretation of the Bible.",
            "So it felt totally appropriate and normal for a church to have the catchphrase “The hope of Jesus in every home”. Less than 5 minutes into the sermon that night, the pastor told a story which indirectly conflated children’s exposure to the concept of gender identity with evil. How appropriate for the first time I had physically been inside a church in probably at least a year after coming out and being rejected for it. It definitely gives off the vibe that somehow they feel that I don’t deserve the hope of Jesus in my home."
          ]
        },
        "order": 2
      },
      {
        "type": "text",
        "title": "The Illusion of Inclusion",
        "content": {
          "paragraphs": [
            "Another common thing you see in churches is a major push to get attendees into small group settings where they can “dig deeper”. Another way of putting this is catchphrases like “life is better together”. They use Bible verses to back it up too, like Hebrews 10:24-25. You know what really hurt though? This church couldn’t get it past them to even let me join a small group after coming out. They just kept putting it off. All I wanted was to join a group of women to study the Bible. They just kind of let the whole thing slip through the cracks and tried to forget about it."
          ]
        },
        "order": 3
      },
      {
        "type": "quote",
        "content": {
          "text": "I beg, By God in heaven, please learn your lesson",
          "author": "Asabaal Horan"
        },
        "order": 4
      },
      {
        "type": "text",
        "title": "The Space Between Intentions and Impact",
        "content": {
          "paragraphs": [
            "I genuinely believe that the majority of Christians, and of religious folks in general, are genuinely “good” people, meaning that they have only the best of intentions. In fact, I believe this of most people in general. We all definitely fail. That’s the entire concept of sin anyway, that we simply don’t live up to a perfect standard. But at least we’re trying out here.",
            "It’s because of this that, instead of trying to say something bad about the people and institutions which have wronged me, I beg, “By God in heaven, please learn your lesson”. I think everyone is capable of learning from their wrongs in a way that makes sense to them. That turns the problem into one of understanding psychology on the deepest levels. If we can understand the way someone else is thinking, we can say something that makes sense to them, but also challenges their beliefs."
          ]
        },
        "order": 5
      },
      {
        "type": "text",
        "title": "Meditation and the Search for Peace",
        "content": {
          "paragraphs": [
            "Another extremely important point I called out in this song is that I spent a lot of time meditating, trying to make sense of all of the chaos I was experiencing and witnessing around me. It honestly felt completely ridiculous. But then I remembered something - Jesus was famous for doing this (Luke 5:16). And it was in this time of meditation that I found my peace and blessings."
          ]
        },
        "order": 6
      },
      {
        "type": "text",
        "title": "Understanding Microaggressions",
        "content": {
          "paragraphs": [
            "When I was first introduced to the term “microaggression”, it was in the context of racism. At first, it didn’t make any sense to me. In fact, I was kinda bothered by the term. Eventually I accepted that people truly felt these things, and that I just didn’t understand that experience. After I started experiencing microaggressions because of my gender identity, I got it. That feeling sucks a lot.",
            "I want everyone to be more cognizant of the things they say and do. Oftentimes we hurt people without even realizing it. What are your stories of microaggressions? How have you overcome them and chosen to act in peace and love? Let’s bring this conversation into every home."
          ]
        },
        "order": 7
      },
      {
        "type": "image",
        "content": {
          "src": "in-love-and-unity.jpg",
          "alt": "A visual representation of unity and love in community",
          "caption": "In love and unity, we find strength to grow together."
        },
        "order": 8
      }
    ]
  },
  "author": {
    "name": "Asabaal Horan",
    "signature": "In love and unity,<br><strong>Asabaal Horan</strong><br>Founder, Asabaal Ventures"
  }
}