{
  "metadata": {
    "title": "By My Hand: Discarding Hurt for Unity",
    "slug": "by-my-hand-discarding-hurt-for-unity",
    "publishDate": "2024-09-18",
    "tags": [
      "Christianity",
      "LGBTQ+",
      "discrimination",
      "unity",
      "faith"
    ],
    "excerpt": "A personal journey of facing discrimination in the church while refusing to let hurt separate us from unity and love.",
    "coverImage": "by-my-hand.jpg",
    "featured": false,
    "status": "published"
  },
  "content": {
    "sections": [
      {
        "type": "featured_video",
        "content": {
          "url": "https://youtu.be/tplM-xoG-XA",
          "title": "By My Hand: Discarding Hurt for Unity"
        },
        "order": 0
      },
      {
        "type": "intro",
        "content": {
          "text": "Hello World! I'm really hesitant to share the story behind this song. I want to frame this right. I want to make this very clear that I have no negative feelings towards anyone, and the experience which motivated both this song and my song \"Microaggression\". I want to respect the anonymity of the person(s) involved, and I want to give you an insight into my passion."
        },
        "order": 1
      },
      {
        "type": "text",
        "title": "A History of Distance",
        "content": {
          "paragraphs": [
            "Here's what's gonna happen: I'm gonna simply tell it like it is. Throughout my adult life, I have felt distant from the Christian church as an institution. I kept seeing issues left and right with how people believed and practiced. I was regularly discarded like I was trash for speaking up against something that felt wrong to me, and there weren't ever really peaceful resolutions.",
            "When I finally accepted my gender identity for what it was, the result was no different, but this time, I told myself I refuse to let this separate me from the church. My faith is an innate part of me, and the church has caused enough harm to me and to society in general, so it's time for me to make a difference."
          ]
        },
        "order": 2
      },
      {
        "type": "text",
        "title": "The Experience of Discrimination",
        "content": {
          "paragraphs": [
            "I played guitar and sang in church bands on and off for roughly 15 years. The church behind the band I was playing in when I came out didn't hesitate to restrict my ability to participate. One day, long after I had coped with the loss and invigorated myself with my purpose, I chose to talk to the senior pastor of the church.",
            "I wanted to preface my point with the undeniable context that I was being discriminated against in that space. I was immediately interrupted when I said this. The pastor indicated that it was all in my head, and that it was only because of me that either I felt this way or that I was actually discriminated against. At the end of the conversation, the pastor smiled at me and said, \"Thank you for your time\", as if that comment made sense to say, and then walked away."
          ]
        },
        "order": 3
      },
      {
        "type": "text",
        "title": "Choosing Love Over Hurt",
        "content": {
          "paragraphs": [
            "I refuse to believe that this pastor had it in mind to gaslight me, even though that's what happened. I bet that the pastor's story is a story of love, unification, and apology for the pain I had experienced, with a plea to achieve my potential in that community.",
            "I honestly love this song. I get really into it. I have talent. I have passion. And they aren't trivial. And I do want to serve the mission of Christianity, like I'm told I'm supposed to by the church and by my own beliefs. And I have ambition, so I want to connect with folks with reach to help me accomplish my goals, and because I feel a genuine connection to these people."
          ]
        },
        "order": 4
      },
      {
        "type": "quote",
        "content": {
          "text": "How can the elect of God be so blind?",
          "context": "A question posed in the song, reflecting on Matthew 24:24"
        },
        "order": 5
      },
      {
        "type": "text",
        "title": "Understanding Deception and History",
        "content": {
          "paragraphs": [
            "I know the answer to the question I pose, \"How can the elect of God be so blind?\" It's simple. The Bible suggests this might be possible (Mat 24:24). I love the way that verse is posed. It makes it sound absolutely absurd that those who follow God could be deceived by evil, and yet we have seen it over and over again throughout history. Genocide, slavery, restrictions of religious and bodily freedoms, and more.",
            "I don't really like suggesting that good-meaning Christians have all been deceived, but like most religions with a great deal of success, powerful indoctrination tactics are used to confuse people into believing certain things, even if those purporting those beliefs don't recognize that's what's happening."
          ]
        },
        "order": 6
      },
      {
        "type": "text",
        "title": "A Call for Unity",
        "content": {
          "paragraphs": [
            "I can't and I won't say that every person throughout history who identified as a Christian had good intentions. For crying out loud, even the Nazis had their own translation of the Bible! What I will say is that we've had enough stories of hurt and pain caused by churches, or anyone for that matter. Churches are made up of people, so it's not really churches that's hurting people, it's people that are hurting people.",
            "For some reason, people think it's ok to treat other people differently, i.e. less than, for whatever reason. I am so done with that. How have you, or someone you know, been treated as less than? Are you sick of it too? Join me in the fight for fair treatment of all humans."
          ]
        },
        "order": 7
      }
    ]
  },
  "author": {
    "name": "Asabaal Horan",
    "signature": "In love and unity,<br><strong>Asabaal Horan</strong><br>Founder, Asabaal Ventures"
  }
}