{
  "metadata": {
    "title": "\"More Than Me\": How My Beliefs Evolved",
    "slug": "more-than-me-how-my-beliefs-evolved",
    "publishDate": "2024-08-19",
    "tags": [
      "faith",
      "personal-growth",
      "love",
      "christianity",
      "transformation"
    ],
    "excerpt": "A deeply personal story of transformation, exploring how love and truth challenged my conservative upbringing and changed my understanding of faith.",
    "coverImage": "more-than-me.jpg",
    "featured": false,
    "status": "published"
  },
  "content": {
    "subtitle": "A Personal Journey of Faith, Love, and Understanding",
    "sections": [
      {
        "type": "video",
        "content": {
          "url": "https://www.youtube.com/watch?v=Opmn9jJO7Gw",
          "title": "More Than Me - Official Video"
        },
        "order": 0
      },
      {
        "type": "intro",
        "content": {
          "text": "Hello World! Oof. I gotta say, I really postponed writing this post because it's such a difficult one to face for me. My song \"More Than Me\" is a deeply personal story of transformation in my life. I was raised in a conservative Christian environment, and this song shares the story of how I came to recognize that simply being gay didn't make one evil."
        },
        "order": 1
      },
      {
        "type": "text",
        "title": "The Foundation: Love as Discipleship",
        "content": {
          "paragraphs": [
            "One of my favorite Bible verses was a major inspiration for this song. I've rephrased the verse to make it a little more relatable in my marketing, and it goes like this, \"Your love for each other proves your discipleship.\" (John 13:35). I've always known deep down that this was at the core of the Christian message. There's a reason Jesus tells his followers that the entirety of God's message was to love God and love people (Mat. 22:37-40).",
            "This brings me to the hook of the song. If Christians are supposed to \"love God\" then it would help to have an idea of what exactly God is. Fortunately, for the believer, this information is readily available! Christians are told that God is love (1 John 4:8) and God is truth (John 14:6). So at the end of the day, there is one thing that is the ultimate foundation of my understanding of God in my faith, and it's this:"
          ]
        },
        "order": 2
      },
      {
        "type": "quote",
        "content": {
          "text": "If God is love & God is truth, then that's the life that I must choose",
          "attribution": "From \"More Than Me\""
        },
        "order": 3
      },
      {
        "type": "text",
        "title": "Confronting My Own Arrogance",
        "content": {
          "paragraphs": [
            "The next most important part of this song is the pre-chorus. It was traditional in my religious upbringing to be taught that we were right and everyone else was simply just wrong and would ultimately face punishment for it (John 3:18). This is why I wrote \"I believed that I knew best\". I thought highly of myself and my way of thinking, even though now I look back and see how hateful much of it was.",
            "The pre-chorus finishes by setting up the premise of how I was taught to navigate an understanding of my beliefs and how to grow and change if it was necessary. Recognizing that even if what I thought was best got proved wrong somehow, I needed to have a foundation to rely on to help me cope with that and reframe what I thought was true."
          ]
        },
        "order": 4
      },
      {
        "type": "text",
        "title": "The Moment Everything Changed",
        "content": {
          "paragraphs": [
            "There's a phrase from an artist I love: \"All is true\". As of today, I'm not prepared to share all of the details of this story, but I want you to know that every phrase of this song reflects something true of my experience. I really did have a hateful viewpoint, thinking things like \"evil little devil's friend\" for people who actively engaged in activities which I labeled as sin. I really did lose my closest friends, and my actions were a major contributor to that happening.",
            "And I really felt uncomfortable being in the presence of queer folk, and it really was a queer person who comforted me in my distress. I realized I wouldn't have done the same for this person at that time in my life. That messed me up inside. I knew at that point that I must be wrong about something if \"gay loves more than me\", because it all comes back to that deep root of what I knew was true about Christianity, that God is love, God is truth, and that loving each other is the proof of our discipleship."
          ]
        },
        "order": 5
      },
      {
        "type": "image",
        "content": {
          "src": "in-love-and-unity.jpg",
          "alt": "In Love and Unity",
          "caption": "The message of love and unity that drives everything I do"
        },
        "order": 6
      },
      {
        "type": "text",
        "title": "Heaven on Earth",
        "content": {
          "paragraphs": [
            "This is why \"More Than Me\" is part of my debut. I want the world to know that if any group of people is going to be the most relentlessly loving people, that I need to be in that group, because that's what I was raised to believe. This same concept drives the entirety of my mission at Asabaal Ventures. My goal isn't to gain some fans or make some money. It's about reaching people with love and unity.",
            "At Asabaal Ventures, I'm not proselytizing because I don't want that to be part of my business. I do want to share my perspective about what it means to be Christian because I think it's so much more than a message about how to achieve paradise and avoid punishment. Jesus prayed for God's will to be done \"on earth, as it is in heaven\" (Mat 6:10). On earth as it is in heaven. That is a powerful concept. Heaven is supposed to be this place without suffering (Rev 21:4). If we can have that on earth, then I want to be a part of making that happen. I want to be a part of something greater, something more than me."
          ]
        },
        "order": 7
      }
    ]
  },
  "author": {
    "name": "Asabaal Horan",
    "signature": "In love and unity,<br><strong>Asabaal Horan</strong><br>Founder, Asabaal Ventures"
  }
}