{
  "metadata": {
    "title": "Power of Pain - You Already Feel It; Leverage It",
    "slug": "power-of-pain-you-already-feel-it-leverage-it",
    "publishDate": "2024-11-22",
    "tags": [
      "pain",
      "collaboration",
      "game-theory",
      "injustice",
      "entrepreneurship"
    ],
    "excerpt": "Pain is inevitable, but it doesn't have to define you. This post explores how to transform suffering into strength through collaboration, using the prisoner's dilemma as a metaphor for collective action against systemic injustice.",
    "coverImage": "power-of-pain.jpg",
    "featured": false,
    "status": "published"
  },
  "content": {
    "subtitle": "Transforming Suffering into Strength Through Collaboration",
    "sections": [
      {
        "type": "intro",
        "content": {
          "text": "Hello world,\n\nYou know exactly what I’m talking about when I say this. I’m sure of it. You have felt pain. Especially pain you didn’t deserve. And it beats you down. It hurts you & destroys you. Pain is powerful.\n\nIt’s so painful that I’ve tried as long as I can to not write this post. No one really wants to talk about pain, do they?"
        },
        "order": 1
      },
      {
        "type": "text",
        "title": "The Prisoner’s Dilemma of Pain",
        "content": {
          "paragraphs": [
            "Have you ever heard people complaining about their lives, and the hurt they are experiencing, the ways they’ve been mistreated? I know I have all the time. I think complaining about our pain is our default mode. It’s easier to do nothing now than to fight against it, but the problem with that is that we end up in a worse place than if we had done something.",
            "There’s a concept in game theory that I identify with very deeply - the prisoner’s dilemma. I love the name of it too, because it suggests that deep down, we are all prisoners of the poor choices we make. Lemme provide a real brief explanation of it just to give you a little context, but I’m gonna put a little twist on it to highlight my point.",
            "You and I both got screwed over by the same massive tech corporation. They stole our innovations, buried our patents in legal paperwork, and left us each with barely enough settlement money to survive - just $5 million each for a product easily worth billions! It's not justice, it's just enough to keep us quiet and out of the headlines.",
            "One day, each of us receives an encrypted message:\n\n\"I've been tracking Big Tech's illegal practices for years. I'm building a case, and I know what they did to you. Here's the deal: I can help you expose them, but you'll need to make a choice. You can either collaborate with your fellow victim, do nothing, or try to take full credit for the exposé.\n\nIf you both collaborate, I can build an ironclad case. The evidence of their pattern of abuse would be undeniable. You'd each receive $100 million in damages, and more importantly, you'd set a precedent that could protect future innovators.\n\nIf one of you takes sole credit while the other helps, you could get $20 million, but they'll get nothing - and Big Tech will spin it as a disgruntled employee situation.\n\nIf you both try to take credit independently, you'll discredit each other, and Big Tech's PR machine will bury the whole thing. You'll lose even your initial settlements in the legal aftermath.\n\nOf course, you can both just keep your current settlements and do nothing. Your choice.\"\n\nI like seeing this put in a table"
          ]
        },
        "order": 2
      },
      {
        "type": "text",
        "title": "The Math of Mutual Suffering",
        "content": {
          "paragraphs": [
            "| *Valuation ($) (me, you)* |        **You** |  |  |\n| --- | --- | --- | --- |\n| **Me** | Collaborates | Does Nothing | Takes Credit |\n| Collaborates | 100M, 100M | 5M, 5M | 0, 20M |\n| Does Nothing | 5M, 5M | 5M, 5M | 0, 20M |\n| Takes Credit | 20M ,0 | 20M, 0 | 0, 0 |",
            "We have the opportunity to work together, and if we do it, we each end up way better off than if we continue as is or try to take credit for each other’s work. Doing nothing keeps things exactly like they are, but if one of us decides the other’s injustice isn’t our problem, so we take full credit for the victimhood, things start to get dicey. We could both end up with nothing!"
          ]
        },
        "order": 3
      },
      {
        "type": "text",
        "title": "From Pain to Purpose",
        "content": {
          "paragraphs": [
            "Maybe $5 million sounds like a lot of money, but it really isn’t. It is enough for financial freedom, but nothing close to what we deserved. Of course, most of us aren’t swimming in money like this, but I hope the point is clear. Working together requires a lot more work than only caring about ourselves, but the ROI is massive.",
            "That’s what my business is about. I see the entire world as a system full of injustices. We’ve all been wronged, and we’ve all received very little in return for these injustices. It’s time that we see the prisoners’ dilemmas all around us, and recognize that, instead of letting that pain keep us down, if we start collaborating, we can all get out of the mud.",
            "There is so much money in the world that I refuse to believe that extreme poverty has to exist. In fact, I intend to prove that it doesn’t need to, and demonstrate pathways to ending it.",
            "When I was wronged, that’s what I decided to do. I believe it is a violation of human rights to be fired from your job. Why? Because, for most of us, that is our only source of income, and without that, we are a heartbeat away from losing everything. Bad behavior still needs to be addressed, but not in that way.",
            "I was fired from my job, and in return, I decided that it was time to pivot to full time focusing on my business. I decided to leverage my pain to make something great, and I will never back down, ever. How have you been wronged? Have you found how you can leverage that pain to make something better? Let me know!"
          ]
        },
        "order": 4
      },
      {
        "type": "image",
        "content": {
          "src": "in-love-and-unity.jpg",
          "alt": "In love and unity signature",
          "caption": "In love and unity,<br><strong>Asabaal Horan</strong><br>Founder, Asabaal Ventures"
        },
        "order": 5
      }
    ]
  },
  "author": {
    "name": "Asabaal Horan",
    "signature": "In love and unity,<br><strong>Asabaal Horan</strong><br>Founder, Asabaal Ventures"
  }
}