{
  "metadata": {
    "title": "What Happens When A Queer Christian Remixes Anike's 'Send That'?",
    "slug": "what-happens-when-queer-christian-remixes-anikes-send-that",
    "publishDate": "2025-02-05",
    "tags": [
      "Christianity",
      "LGBTQ+",
      "Music",
      "Remix",
      "Faith"
    ],
    "excerpt": "A queer Christian's journey through music, faith, and the hope for church acceptance while pursuing a remix challenge.",
    "coverImage": "send-that.jpg",
    "featured": false,
    "status": "published"
  },
  "content": {
    "subtitle": "A Story of Faith, Music, and the Hope for Unity",
    "sections": [
      {
        "type": "video",
        "content": {
          "url": "https://youtu.be/jUbhACa1aFY?si=gX6P3iiwZFwpBWkb",
          "title": "Asabaal's Remix of Anike's 'Send That'"
        },
        "order": 0
      },
      {
        "type": "intro",
        "content": {
          "text": "Hello world! Well, it has been some time since I've been hot off the press with a lot of content! But like I said, I've been in the phase of operationalizing the business, and it's been great! I've been harder on myself than I need to be about the pace of my content cycles, but I have to say, I'm excited to be sharing with you now! So, why now? Well, I stumbled across Anike's Send That Open Verse Remix Challenge!"
        },
        "order": 1
      },
      {
        "type": "text",
        "title": "My Musical Journey and AI's Role in Creativity",
        "content": {
          "paragraphs": [
            "If it wasn't clear by now, I love music, and I love listening to Christian artists in particular! My connection to music has been strong ever since I was a child. The way it helps me to feel highly specific feelings and deep connections to specific moments has been transformative in my life.",
            "It was, in part, these feelings that led me to have the drive and joy to play in church worship bands throughout the years, and I played guitar and sang in church bands on and off about half the time over a 15 year period. As a musician of over 20 years, it deeply troubles me when people look at AI-generated music as somehow less valuable or artistic than traditionally-generated music.",
            "So, for me, AI isn't a creativity killer, but a creativity enabler! And with my rigorous academic background and professional experience in data science, leading me to have a naturally intuitive understanding of the inner workings of AI models, I see the future of music to be brighter than ever!"
          ]
        },
        "order": 2
      },
      {
        "type": "text",
        "title": "\"I Never Asked To Be Queer\" - My Professional Debut",
        "content": {
          "paragraphs": [
            "Recently, I announced my professional debut album, \"I Never Asked To Be Queer\"! So far, what I've released has been generated by AI, and then edited by me. With each project, I have aimed and will continue to both aim and achieve some sort of improvement in the quality of what I release!",
            "Obviously the theme of the album is about my experience of realizing that I was different from most of the people I grew up around, and how it led to so much judgement from the people and communities that I thought loved me. And what makes this particularly painful for me is that these people and communities were Christian."
          ]
        },
        "order": 3
      },
      {
        "type": "text",
        "title": "The Pain of Church Rejection",
        "content": {
          "paragraphs": [
            "Honestly, I thought Christianity was pretty simple, and that's exactly what the church I grew up in taught too! All you had to do if you wanted to be a Christian was confess with your mouth that Jesus is Lord and believe in your heart that God raised him from the dead. And the most important commandments came directly from Jesus. You had to love God, and you had to love your neighbors, and anyone in need was your potential neighbor.",
            "But when I came out as queer to the church where I was playing in their worship band, it was a problem for them. And this type of experience has happened to so many people. What makes this even worse, it's this modern environment we're in. It's not safe to be queer in the United States right now."
          ]
        },
        "order": 4
      },
      {
        "type": "text",
        "title": "My Reach Records Ambition",
        "content": {
          "paragraphs": [
            "One of my ambitions is to become the first openly queer artist to land a contract with Reach Records. For me, the Reach Records mission has always inspired me. I was taught growing up that most Christian music wasn't really \"Christian\". But not Reach Records. Not only was this good music, evidence that \"Christian music doesn't suck anymore\", but it was also full of hard-hitting songs with powerful Christian messages.",
            "To be truly unashamed of the gospel of Christ was what I always wanted. That's the whole point of Christianity anyway, right? To share the good news? And it didn't happen until after I chose my name. \"The maker is my husband\" is my name. And it comes straight from the Bible."
          ]
        },
        "order": 5
      },
      {
        "type": "text",
        "title": "Connecting with Anike's Journey",
        "content": {
          "paragraphs": [
            "So, let me tell you. When Reach signed Anike, then Wande, I was beyond psyched! Their first female artist! And that debut single was definitely great stuff! When she got playlisted by Michelle Obama, I was thrilled! And now, to be known as the first female Christian hip hop artist with major commercial success, that's incredible!",
            "Sometime after I had chosen my name, she announced her chosen name. When I heard why she did this, I was blessed. Someone else chose their name because they wanted it to reflect something deep about who they were and their connection to God! I thought, how nice would it be to talk about this with her one day?"
          ]
        },
        "order": 6
      },
      {
        "type": "text",
        "title": "A Call for Church Unity and Protection",
        "content": {
          "paragraphs": [
            "I don't think the church has to cause so many problems for people like me. We are intelligent enough, as a species, and empathetic enough, as Christians, that there is no reason we can't work out our differences. Whether or not it's ok to discriminate against someone for any reason whatsoever by treating them differently and less than, whether consciously or subconsciously, is not Christlike behavior.",
            "I need the church to get behind protecting queer people, and any and all marginalized groups, actively. I am a human being, made in the image of God. I am a fellow Christian, seeking to live out the calling God has given. And I am also the target of vicious attacks.",
            "It took me responding to one conservative Christian pastor's Facebook post, and interacting with the comments with only edifying speech for one day, to get \"God told Christians to kill men like you\". The church should be condemning that behavior, but instead they are silent on the topic. It's time to change that."
          ]
        },
        "order": 7
      },
      {
        "type": "text",
        "title": "Why I'm Really Doing This Remix",
        "content": {
          "paragraphs": [
            "And whether or not I \"win\" this remix challenge, which would be a massive opportunity for me and my business, I hope more than all that Anike will take the time to read this, reflect deeply on it, and consider having a conversation with me.",
            "That's really why I'm doing this remix challenge. When I saw it, I was initially excited, but then I thought I am way too busy and don't have the time to waste on that right now. But God knew I wanted to enter anyway, and then it hit me. My verse was going to be my prayer for the church in this time to rise up and fulfill its calling to bring God's will, on earth, as it is in heaven - without suffering and pain.",
            "That sounds an awful lot like global peace to me. So church, what do you say, want to help me make my \"Next Claim\" a reality?"
          ]
        },
        "order": 8
      },
      {
        "type": "image",
        "content": {
          "src": "in-love-and-unity.jpg",
          "alt": "In Love and Unity - Asabaal's Signature"
        },
        "order": 9
      }
    ]
  },
  "author": {
    "name": "Asabaal Horan",
    "signature": "In love and unity,<br><strong>Asabaal Horan</strong><br>Founder, Asabaal Ventures"
  }
}