{
  "metadata": {
    "title": "Probably Right: You're Probably Right, And So Am I, Even When It Hurts",
    "slug": "probably-right-accepting-criticism-with-humility",
    "publishDate": "2024-12-27",
    "tags": [
      "self-reflection",
      "humility",
      "business-journey",
      "personal-growth",
      "transparency"
    ],
    "excerpt": "A raw exploration of accepting criticism, embracing humility, and finding growth through honest self-reflection.",
    "coverImage": "probably-right.jpg",
    "featured": false,
    "status": "published"
  },
  "content": {
    "subtitle": "Learning to embrace criticism and find growth through humility",
    "sections": [
      {
        "type": "featured_video",
        "content": {
          "url": "https://youtu.be/e6umF8X_93Q?si=H9ua5fZOiigPrSUL",
          "title": "Probably Right - Official Music Video"
        },
        "order": 0
      },
      {
        "type": "intro",
        "content": {
          "text": "Hey everyone! It's been a few weeks, and I'm totally sorry for the delay! Asabaal Ventures is experiencing growing pains! It definitely hurts, but I'm so excited about what it's becoming so I can bring you all so much more value! Something I have struggled with is understanding why I am where I am at, both in life and with my business. Whether it's self-critique or negative words from others, it's so easy, at least for me personally, to feel like what I'm doing has no or very little value."
        },
        "order": 1
      },
      {
        "type": "text",
        "title": "The Critics Are Probably Right",
        "content": {
          "paragraphs": [
            "You may be wondering what any of this has to do with this song. Well, it's quite simple - the critics are \"Probably Right\". And this is a hard pill to swallow. And it doesn't mean that the music sucks or that my ideas aren't powerful. More practically, it's about the execution strategy.",
            "I'm being completely transparent about my own personal reflections on my business as part of the next evolution of Asabaal Ventures."
          ]
        },
        "order": 2
      },
      {
        "type": "text",
        "title": "Introducing \"My Business Story\"",
        "content": {
          "paragraphs": [
            "I'm working on launching a new series called \"My Business Story\"! I want to share my journey as I'm taking it, both to document the pathways which do and do not lead to successful achievements of my goals, and to share these pathways with you.",
            "This has always been part of the plan, but I'm beginning to think that for the near-term foreseeable future, this is one of the primary outlets that will bring more value."
          ]
        },
        "order": 3
      },
      {
        "type": "text",
        "title": "The Song's Deeper Message",
        "content": {
          "paragraphs": [
            "When I wrote this song, I felt that it was different somehow from the songs I had written previously to it. I'll admit, after having had it in my playlist for a while now, I do think the bridge is kinda cheesy. But I can always make a better version of the song for the future, and I think the message of this song is powerful, and sets a standard of the type of messaging I want to have with Asabaal Ventures.",
            "People are so diverse in their backgrounds and subsequent perspectives, and throughout my years, I've had far too many people tell me how terrible either my actions are or even I am as a person. But I never really thought I was that bad of a person. I am a Christian after all, and Christianity is supposed to be about love & goodness over hate & evil first & foremost."
          ]
        },
        "order": 4
      },
      {
        "type": "quote",
        "content": {
          "text": "We've all got flaws & demons hidden underneath our disguise",
          "attribution": "From the song \"Probably Right\""
        },
        "order": 5
      },
      {
        "type": "text",
        "title": "The Humility to Accept We're All Flawed",
        "content": {
          "paragraphs": [
            "So, how am I supposed to reconcile these seemingly contradictory notions? Am I or am I not a bad person? And what about other people? I came to realize something that, while very obvious, also hit very deep for me. And what hurts even more is that the more I grow, the more I see my own flaws and how I've mistreated others in the past and in the present.",
            "So I decided that maybe it didn't really matter anymore what I thought. If someone tells me I did something wrong, they're probably right, even if I disagree on what exactly it was. In fact, I made them feel like I behaved in whatever way they accused me of, so it might as well be real. They might as well be right. Maybe they are right. I suppose they're probably right."
          ]
        },
        "order": 6
      },
      {
        "type": "image",
        "content": {
          "src": "in-love-and-unity.jpg",
          "alt": "In Love and Unity",
          "caption": "Growing together through honest self-reflection"
        },
        "order": 7
      },
      {
        "type": "text",
        "title": "Taking the Plank Out of Your Own Eye",
        "content": {
          "paragraphs": [
            "So yeah, whenever you have something to say that critiques me, I bet there is something in there that is probably right. But what makes it harder is that means when I critique someone else, I'm probably right too. Are you willing to humble yourself in the ways I've been talking about humbling myself?",
            "Have you gone through the exercise of allowing others' opinions of you to shape your understanding of yourself, even if it hurts? I'd love to hear your stories! This is what it looks like to take the plank out of your own eye. So no longer will I assume I mostly have it together. In fact, I probably mostly don't have it together. But together we can identify ways in which we each can become better."
          ]
        },
        "order": 8
      },
      {
        "type": "text",
        "title": "Moving Forward with Asabaal Ventures",
        "content": {
          "paragraphs": [
            "So, in closing, I don't know what the timelines for Asabaal Ventures look like right now because I need to make some changes. But I want you to know that I am giving this my all every day and I'm going to share as many things as I am able to as quickly as I am able to.",
            "While my first best case scenario didn't pan out exactly the way I wanted it to, that's completely ok because that means I have more opportunities to learn, grow, and acknowledge my own shortcomings so that I can overcome them. We leveling up! Let's goooooo!"
          ]
        },
        "order": 9
      }
    ]
  },
  "author": {
    "name": "Asabaal Horan",
    "signature": "In love and unity,<br><strong>Asabaal Horan</strong><br>Founder, Asabaal Ventures"
  }
}