{
  "metadata": {
    "title": "Logical Fallacies - Let's Start Thinking Together",
    "slug": "logical-fallacies-lets-start-thinking-together",
    "publishDate": "2024-11-01",
    "tags": [
      "logical-thinking",
      "communication",
      "relationships",
      "empathy",
      "self-improvement"
    ],
    "excerpt": "A call for elevated thinking and rational dialogue to overcome communication barriers and build stronger relationships.",
    "coverImage": "logical-fallacies.jpg",
    "featured": false,
    "status": "published"
  },
  "content": {
    "subtitle": "Elevating Our Conversations Through Rational Dialogue",
    "sections": [
      {
        "type": "video",
        "content": {
          "url": "https://youtube.com/watch?v=php7rhrpAe4",
          "title": "Logical Fallacies - Let's Start Thinking Together"
        },
        "order": 0
      },
      {
        "type": "intro",
        "content": {
          "text": "Some conversations are hard to have. Something that makes conversations even harder to have is when there is a lack of thoughtfulness from the people in the conversation. I don't know about you, but for me, when someone isn't really thinking about what they're saying, I get rather internally frustrated. When someone says things which are clearly unfounded and riddled with logical fallacies, it makes the conversation very difficult to have. I can't make progress in a conversation with someone when they aren't thinking rationally."
        },
        "order": 1
      },
      {
        "type": "text",
        "title": "The Educational and Personal Journey",
        "content": {
          "paragraphs": [
            "Good news for us - humans think super irrationally! Lovely. I wrote this song with the hope that listeners will intentionally elevate their level of thinking so that they can have more productive conversations with people.",
            "This song is both educational and highly personal. My relationship with my primary partner was falling apart, and I felt like it didn't matter what I said or did, nothing would be interpreted logically. I believe that taking the time to process your feelings, evaluate why you feel the way you feel, and then rationally convey that information is a sure-fire way to resolve conflicts."
          ]
        },
        "order": 2
      },
      {
        "type": "text",
        "title": "The Challenge of Knowledge",
        "content": {
          "paragraphs": [
            "One of the challenges I have faced in life is being both intelligent and highly knowledgeable. Yeah, that's right. It's a challenge for me! I have found that the combination of intelligence & knowledge differentials between myself and my partners along with a lack of emotional maturity have been major contributors in destroying multiple long-term partnerships.",
            "Another downside to being highly knowledgeable is that I am often right, and that can lead to people perceiving me as narcissistic and judgemental. It can also make it difficult for me to know when I am wrong, because I have my own internal selection bias that says I am more likely to be right about something than not. If I don't manage myself effectively, having knowledge is just as much of a curse as not having it."
          ]
        },
        "order": 3
      },
      {
        "type": "text",
        "title": "A Problem-Solving Approach",
        "content": {
          "paragraphs": [
            "However, I fancy myself a problem-solver. I refuse to accept that the state of affairs in the world and in my life is the state that it should stay in forever. I must improve. I must rid myself of my own flaws. I want critical self-evaluation of our assumptions and resulting conclusions using solid logic to become a regular part of daily life.",
            "This song is meant to help you feel comfortable talking about these issues, and I intend to continue developing & utilizing tools to make this feel natural. Instead of us using logical fallacies regularly, I want us to use airtight logic. I want us to be willing to understand each other based on our individual world models. I want us to empathize with each other, and I believe that a strong logical foundation is critical to true empathy."
          ]
        },
        "order": 4
      },
      {
        "type": "text",
        "title": "Choosing Understanding Over Judgment",
        "content": {
          "paragraphs": [
            "I came to the point in my life where I truly refuse to judge anyone for anything anymore. Of course, I am a person with feelings, and I do judge people, but I actively reject my judgments, recognizing that if someone's actions didn't make sense to them, they probably wouldn't do them. In other words, I believe that most people subconsciously feel they are acting logically based on what they know.",
            "That's exactly why I can't judge. Instead, I can seek to understand. I can seek to unify. I can seek to demolish cognitive dissonance between viewpoints. I can live in peace because I know that these things are possible, and I am radically aligning my life to these principles. We can accomplish so much more as individuals and as a species, if only we started thinking together."
          ]
        },
        "order": 5
      },
      {
        "type": "text",
        "title": "Let's Start Thinking Together",
        "content": {
          "paragraphs": [
            "So I say it again. Let's start thinking together. How have you encountered frustrating logical fallacies in your life? How have you sought to remedy that? How is it different if the fallacies are your own versus someone else's? Let me know your thoughts!"
          ]
        },
        "order": 6
      },
      {
        "type": "image",
        "content": {
          "src": "in-love-and-unity.jpg",
          "alt": "In Love and Unity - Asabaal's signature message"
        },
        "order": 7
      }
    ]
  },
  "author": {
    "name": "Asabaal Horan",
    "signature": "In love and unity,<br><strong>Asabaal Horan</strong><br>Founder, Asabaal Ventures"
  }
}